app/Controllers/JardimController.php

    public function index()
    {
        $loginId = session()->get('usuario_id');
        if (!$loginId) {
            return redirect()->to('/login');
        }

        // Pega dados do usuário (inclui pontos)
        $usuario = $this->loginModel->find($loginId);
        if (!$usuario) {
            return redirect()->to('/login');
        }

        $jardim = $this->jardimModel->where('login_id', $loginId)->first();
---
SELECT *
FROM `login`
WHERE `login`.`LoginId` = '2'
SELECT *
FROM `jardim`
WHERE `login_id` = '2'
 LIMIT 1

    public function realizarAcao($acao)
    {
        $loginId = session()->get('usuario_id');
        if (!$loginId) {
            return redirect()->to('/login');
        }

        $usuario = $this->loginModel->find($loginId);
        if (!$usuario) {
            return redirect()->to('/login');
        }

        $jardim = $this->jardimModel->where('login_id', $loginId)->first();
---
SELECT *
FROM `login`
WHERE `login`.`LoginId` = '2'
SELECT *
FROM `jardim`
WHERE `login_id` = '2'
 LIMIT 1


        // Deduz pontos do usuário
        $novoSaldo = $usuario['Pontos'] - $custo;
        $this->loginModel->update($loginId, ['Pontos' => $novoSaldo]);
---
UPDATE `login` SET `Pontos` = 145
WHERE `login`.`LoginId` IN ('2')

        }

        // Atualiza jardim com novos pontos gastos e nível
        $this->jardimModel->update($jardim['id'], [
            'pontos_gastos' => $pontosGastosNovos,
            'nivel' => $novoNivel,
        ]);
---
UPDATE `jardim` SET `pontos_gastos` = 30, `nivel` = 1, `updated_at` = '2025-06-29 18:54:04'
WHERE `jardim`.`id` IN ('2')