app/Controllers/Produtos.php

SELECT *
FROM `produtos`
---
    public function listar()
    {
        $produto_model = new ProdutoModel();

        $produtos = $produto_model->findAll();