app/Controllers/Tarefas.php

SELECT *
FROM `tarefas`
WHERE `LoginId` = '2'
AND `concluida` = 0
SELECT *
FROM `login`
WHERE `login`.`LoginId` = '2'
---
    public function listar()
    {
        $tarefa_model = new TarefaModel();
        $login_id = session()->get('usuario_id');

        $tarefas = $tarefa_model
            ->where('LoginId', $login_id)
            ->where('concluida', 0)
            ->findAll();

            $login_model = new LoginModel();
            $usuario = $login_model->find($login_id);